<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>Document sans titre</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />

<link href="gemdoc.css" rel="stylesheet" type="text/css" />
</head>

<body>
<script language="javascript" type="text/javascript" src="header.js"></script>
<div id="articles">
<h1>Recommandations</h1>
<p> Cette nouvelle version du forum Newbb est donc impressionnante par
le nombre des fonctionnalit&eacute;s qu'elle poss&egrave;de, mais tout cela a
un prix. Activez par exemple le modde d&eacute;bug en version mysql/blocs et
observez le nombre de requ&ecirc;tes g&eacute;n&eacute;r&eacute;es sur la page
d'accueil d'un forum.</p>
<p> Si votre site est tr&egrave;s fr&eacute;quent&eacute; et que la puissance
  de votre serveur n'est pas adapt&eacute;e, l'activation de toutes ces nouveaut&eacute;s
  risque de ralentir l'affichage des pages du forum lorsque beaucoup de visiteurs
  seront pr&eacute;sents simultan&eacute;ment sur votre site. C'est pourquoi
  il vous faudra &ecirc;tre attentif &agrave; bien d&eacute;terminer ce qui vous
  semble indispensable par rapport aux options dites de confort pour obtenir
  le meilleur compromis.</p>
<h4>Navigateurs</h4>
<p> Les diff&eacute;rents tests qui ont &eacute;t&eacute; r&eacute;alis&eacute;s
  d&eacute;montrent une meilleure performance de l'affichage avec Firefox par
  rapport &agrave; Internet Explorer. </p>
<h4>Images</h4>
<p> La d&eacute;sactivation du hack png alli&eacute;e &agrave; l'utilisation
  d'un set images ne comportant que des fichiers gif am&eacute;liorent la performance
  de l'affichage( les fichiers du langage fran&ccedil;ais comporte des images
  gif et des png) </p>
<h4>Bouton r&eacute;ponse rapide </h4>
<p> S'il peut &ecirc;tre pratique ce bouton est une source de ralentissement
  de l'affichage.</p>
<h4>Conclusion</h4>
<p> Quelque soit votre situation (nouvelle install de ce forum ou mise &agrave; jour)
  proc&eacute;dez &agrave; une sauvegarde compl&egrave;te de votre site (fichiers
  et tables de la base de donn&eacute;es), testez vos mises &agrave; jour sur
  un clone votre site, en effet si une installation de module est une op&eacute;ration
  habituellement simple, les d&eacute;pendances qu'utilisent ce module sont relativement
  nombreuses et les mises au point n&eacute;cessaires se doivent d'&ecirc;tre
  r&eacute;alis&eacute;es en dehors de votre environnement de production (site
  web public). </p>
</div>
</body>
</html>
