<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <title>Document sans titre</title>
  <meta http-equiv="Content-Type"
 content="text/html; charset=iso-8859-1">
  <link href="gemdoc.css" rel="stylesheet" type="text/css">
</head>
<body>
<script language="javascript" type="text/javascript" src="header.js"></script>
<div id="articles">
<h2>Configuration - Options du module</h2>
<p>Dans l'administration du module, en cliquant sur le menu
pr&eacute;f&eacute;rences, vous allez pouvoir proc&eacute;der au
param&eacute;trage du comportement g&eacute;n&eacute;ral de votre
module de forums. </p>
<h3>Les images</h3>
<p>Les options ci-dessous proviennent des dossiers et fichiers qui sont pr&eacute;sents
  dans le r&eacute;pertoire <em>/newbb/images/imagesets/</em><br />Chaque set d'images peut contenir des fichiers au format gif ou au format png, il vous est possible de créer un répertoire pour chaque langue utilisée dans votre site (english, french, deutch..)</p>
<p><img src="images/config_01.gif" /></p>
<p>L'activation du hack png permet d'obtenir l'effet de transparence dans le
  navigateur Internet Explorer.</p>
<h3> Options des formulaires </h3>
<p><img src="images/config_02.gif" width="567" height="82" /></p>
<p>Les auteurs de cette nouvelle version ont cherch&eacute; &agrave; int&eacute;grer d'autres &eacute;diteurs
  que celui de xoops, afin de faciliter la mise en forme des messages publi&eacute;s.
  Si les options DHTML et comptact sont op&eacute;rationnelles sans aucune modifications
  les autres n&eacute;cessitent une installation particuli&egrave;re.</p>
<p>Lien sur la doc de Koivi </p>
<h3> Upload de fichiers</h3>
<p><img src="images/config_03.gif" width="536" height="170" /></p>
<p>La possibilit&eacute; d'attacher des fichiers &agrave; un message est une r&eacute;volution par
  rapport aux versions pr&eacute;c&eacute;dentes de ce modules. V&eacute;rifier que le r&eacute;pertoire
  uploads/newbb existe bien avec le bon chmod. L'activation des fonctions m&eacute;dia
  permet de visualiser directement dans le message le contenu du fichier. Les
  types de fichiers autoris&eacute;s en uploads se d&eacute;terminent dans les options propres
  &agrave; chaque forum. </p>
<h4>Images</h4>
<p><img src="images/config_04.gif" width="708" height="160" /></p>
<p>&nbsp;</p>
<p><img src="images/config_05.gif" width="497" height="121" /></p>
<p>&nbsp;</p>
<p><img src="images/config_06.gif" width="523" height="357" /></p>
<p>&nbsp;</p>
<p><img src="images/config_07.gif" width="716" height="254" /></p>
<h2>&nbsp;</h2>
<p><img src="images/config_08.gif" width="522" height="79" /> </p>
<p>&nbsp;</p>
<p><img src="images/config_09.gif" width="500" height="170" /></p>
<p>&nbsp;</p>
<p><img src="images/config_10.gif" width="490" height="330" /></p>
<h4>Ajouter un pr&eacute;fixe au sujet </h4>
<p><img src="images/config_11.gif" width="658" height="220" /></p>
<p>Les auteurs de posts, si on leur en donne la possibilit&eacute;, peuvent pr&eacute;fixer
leur question avec des mots cl&eacute;s pr&eacute;par&eacute;s par les administrateurs.
C'est par exemple le cas ici m&ecirc;me avec les mentions NONE,<font color="#00cc00">[resolu]</font>,<font color="#00cc00">[fix&eacute;]</font>,<font color="#ff0000">[requ&ecirc;te]</font>,<font color="#ff0000">[rapport
bug ]</font>,<font color="#ff0000">[non r&eacute;solu]</font> que vous pouvez
choisir lorsque vous cr&eacute;ez un post. Cette fonction est tr&egrave;s utile
pour assurer une bonne r&eacute;activit&eacute; de r&eacute;ponse sur les forums.
En effet un post signal&eacute; par son auteur comme <font color="#00cc00">[resolu]</font> n'est
plus &agrave; relire pour proposer une r&eacute;ponse. </p>
<h4>Mise en garde</h4>
<p><img src="images/config_12.gif" width="830" height="126" /></p>
<p>Vous pouvez afficher une mise en garde dans
  diff&eacute;rentes situations : r&eacute;daction d'un nouveau message, lors d'une r&eacute;ponse,
  &agrave; chaque fois. Ce message d'avertissement sera affich&eacute; en haut de la page concern&eacute;e. </p>
</div>
</body>
</html>
